; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; Warehouse
;
; By: Ryan Xiao Wang, 2024
; License: MIT
;
; The aim is to move remove exactly the boxes that are marked for removal.
; Boxes start on stacks of blocks that are located on a fixed number of bases,
; and can be moved between stacks and bases. Boxes can be removed from the
; stacks and bases they are on when they are the top box.
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain warehouse)
    (:requirements :strips :typing :equality)
    (:types box base) 
    (:predicates 
        (on ?b1 - box ?b2 - box)
        (on-base ?b - box ?base - base)
        (clear ?b - box)
        (clear-base ?b - base)
        (to-remove ?b - box)
        (removed ?b - box)
    )

    (:action move
        :parameters (?b ?old-under ?new-under - box)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-to-new-base
        :parameters (?b ?old-under - box ?new-base - base)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear-base ?new-base)
        )
        :effect (and 
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-from-base
        :parameters (?b - box ?base - base ?new-under - box)
        :precondition (and
            (clear ?b)
            (on-base ?b ?base)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear-base ?base)
            (not (on-base ?b ?base))
        )
    )

    (:action move-between-base
        :parameters (?b - box ?old-base ?new-base - base)
        :precondition (and
            (clear ?b)
            (on-base ?b ?old-base)
            (clear-base ?new-base)
        )
        :effect (and
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear-base ?old-base)
            (not (on-base ?b ?old-base))
        )
    )

    (:action remove
        :parameters (?b ?under - box)
        :precondition (and
            (to-remove ?b)
            (on ?b ?under)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear ?under)
            (not (on ?b ?under))
            (not (clear ?b))
        )
    )

    (:action remove-from-base
        :parameters (?b - box ?base - base)
        :precondition (and
            (to-remove ?b)
            (on-base ?b ?base)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear-base ?base)
            (not (on-base ?b ?base))
            (not (clear ?b))
        )
    )
)

; problem
;; boxes=49, remove_proportion=0.101, bases=19, instance_id=14, output=./training, seed=55

(define (problem warehouse-14)
    (:domain warehouse)
    (:objects
        box1 box2 box3 box4 box5 box6 box7 box8 box9 box10 box11 box12 box13 box14 box15 box16 box17 box18 box19 box20 box21 box22 box23 box24 box25 box26 box27 box28 box29 box30 box31 box32 box33 box34 box35 box36 box37 box38 box39 box40 box41 box42 box43 box44 box45 box46 box47 box48 box49 - box
        base1 base2 base3 base4 base5 base6 base7 base8 base9 base10 base11 base12 base13 base14 base15 base16 base17 base18 base19 - base
    )
    (:init
        (to-remove box6)
        (to-remove box10)
        (to-remove box13)
        (to-remove box48)
        (clear box21)
        (on box21 box38)
        (on-base box38 base1)
        (clear box18)
        (on box18 box16)
        (on box16 box25)
        (on-base box25 base2)
        (clear box28)
        (on box28 box2)
        (on box2 box5)
        (on-base box5 base3)
        (clear box39)
        (on-base box39 base4)
        (clear-base base5)
        (clear box35)
        (on box35 box3)
        (on box3 box48)
        (on box48 box47)
        (on-base box47 base6)
        (clear box31)
        (on box31 box33)
        (on box33 box44)
        (on-base box44 base7)
        (clear box27)
        (on box27 box49)
        (on box49 box24)
        (on box24 box19)
        (on box19 box45)
        (on box45 box32)
        (on-base box32 base8)
        (clear box17)
        (on-base box17 base9)
        (clear box41)
        (on box41 box4)
        (on box4 box1)
        (on box1 box36)
        (on-base box36 base10)
        (clear box13)
        (on box13 box42)
        (on box42 box37)
        (on-base box37 base11)
        (clear box6)
        (on box6 box43)
        (on-base box43 base12)
        (clear box12)
        (on box12 box26)
        (on box26 box9)
        (on box9 box10)
        (on-base box10 base13)
        (clear box14)
        (on box14 box34)
        (on box34 box30)
        (on box30 box40)
        (on-base box40 base14)
        (clear box46)
        (on box46 box23)
        (on-base box23 base15)
        (clear box7)
        (on-base box7 base16)
        (clear box11)
        (on box11 box29)
        (on box29 box20)
        (on-base box20 base17)
        (clear box8)
        (on box8 box15)
        (on-base box15 base18)
        (clear box22)
        (on-base box22 base19)
    )
    (:goal (and 
        (removed box6)
        (removed box10)
        (removed box13)
        (removed box48)
    ))
)

; plan
1. (move box12 box26 box11)
   deleted: (clear box11) (on box12 box26)
   added: (on box12 box11) (clear box26)
   goals met: 0 of 4
2. (move box26 box9 box12)
   deleted: (clear box12) (on box26 box9)
   added: (on box26 box12) (clear box9)
   goals met: 0 of 4
3. (remove box13 box42)
   deleted: (on box13 box42) (clear box13)
   added: (removed box13) (clear box42)
   goals met: 1 of 4
4. (move box35 box3 box14)
   deleted: (clear box14) (on box35 box3)
   added: (on box35 box14) (clear box3)
   goals met: 1 of 4
5. (move box3 box48 box17)
   deleted: (clear box17) (on box3 box48)
   added: (on box3 box17) (clear box48)
   goals met: 1 of 4
6. (move box9 box10 box18)
   deleted: (clear box18) (on box9 box10)
   added: (on box9 box18) (clear box10)
   goals met: 1 of 4
7. (remove-from-base box10 base13)
   deleted: (on-base box10 base13) (clear box10)
   added: (removed box10) (clear-base base13)
   goals met: 2 of 4
8. (remove box48 box47)
   deleted: (on box48 box47) (clear box48)
   added: (removed box48) (clear box47)
   goals met: 3 of 4
9. (remove box6 box43)
   deleted: (on box6 box43) (clear box6)
   added: (removed box6) (clear box43)
   goals met: 4 of 4
